Revit 2027 API
PipingSystem.BaseEquipmentConnector Property
The connector within base equipment which is used to connect with system.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Connector BaseEquipmentConnector { get; set; }
Public Property BaseEquipmentConnector As Connector
	Get
	Set
public:
property Connector^ BaseEquipmentConnector {
	Connector^ get ();
	void set (Connector^ value);
}
member BaseEquipmentConnector : Connector with get, set
Property Value
Connector
Exceptions
Exception | Condition
ArgumentException |  Thrown when assigning a connector which is used in a system, or when the connector's owner is not of type 'mechanical equipment'.
InvalidOperationException |  Thrown when the set operation failed.
Remarks
Setting this property to null will disconnect base equipment from system.
See Also
Reference
PipingSystem Class
Autodesk.Revit.DB.Plumbing Namespace